Autodesk.Revit.DB.BasePoint.GetSurveyPoint(Autodesk.Revit.DB.Document)
Gets the survey point for the document.
cda:
The document from which to get the survey point.
Returns:
The survey point of the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.2

Autodesk.Revit.DB.BasePoint.GetProjectBasePoint(Autodesk.Revit.DB.Document)
Gets the project base point for the document.
cda:
The document from which to get the project base point.
Returns:
The project base point of the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.2